title: Detects SolarPhantom Data Staging Activity
status: experimental
description: Detects indicators of data staging by SolarPhantom
author: RussianPanda
date: 2023/6/21
tags:
    - T1074
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    EventID: 11
    TargetFilename:
      - '*ffxprf_bkp*'
      - '*chrprf_bkp*'
      - '*edgprf_bkp*'
      - '*brvprf_bkp*'
  condition: selection 
falsepositives:
    - Unknown  
level: high
